Revit 2024 API
FillPattern.GetFillGrids Method
 Gets all fill grids in this fill pattern
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<FillGrid> GetFillGrids()
Visual Basic
Public Function GetFillGrids As IList(Of FillGrid)
Visual C++
public:
IList<FillGrid^>^ GetFillGrids()
Return Value
 The fill grids.
See Also
FillPattern Class
Autodesk.Revit.DB Namespace